---
layout: default
title: Acerca de
file: index.html
lang: es
---

<div class="container">
	<div class="row">
		<div class="col-sm-6">
			<p></p>
			<script type="text/javascript">
				randomIndex = Math.floor(Math.random() * 48)+1;
				document.write('<img src="{{ site.baseurl }}/img/me/' + randomIndex + '.jpg" class="img-responsive" alt="Ken Arroyo Ohori">');
			</script>
			<p></p>
		</div>
		<div class="col-sm-6">
			<div class="page-header">
				<h1>Acerca de</h1>
			</div>
			<p>
				Soy un investigador postdoctoral en el grupo de <a href="https://3d.bk.tudelft.nl/">Geoinformaci&oacute;n 3D</a> de la <a href="http://www.tudelft.nl/en/">Universidad de Tecnolog&iacute;a de Delft</a>, en Holanda.
				Actualmente, trabajo la mayor parte del tiempo remotamente desde la Ciudad de M&eacute;xico.
				Hice mi doctorado en el <a href="{{ site.baseurl }}/en/thesis/resumen.html">Modelado de informaci&oacute;n geogr&aacute;fica en altas dimensiones</a> y la Maestr&iacute;a en Geom&aacute;tica en Delft.
				Antes de eso, estudi&eacute; la Ingenier&iacute;a en Tecnolog&iacute;as Computacionales en el <a href="http://www.itesm.edu/">Tecnol&oacute;gico de Monterrey</a> en la Ciudad de M&eacute;xico.
			</p>
			<p>
				La mayor&iacute;a de mi investigaci&oacute;n actual trata sobre modelos, estructuras de datos y algoritmos con objetos en altas dimensiones (4D o m&aacute;s) para Sistemas de Informaci&oacute;n Geogr&aacute;fica.
				La idea es usar estas dimensiones para modelar no solo el espacio, sino tambi&eacute;n otras caracter&iacute;sticas como el tiempo y la escala.
				Tambi&eacute;n me interesan otros temas que combinan la computaci&oacute;n geom&eacute;trica/topol&oacute;gica y la informaci&oacute;n espacial, como los modelos geom&eacute;tricos, la validaci&oacute;n y reparaci&oacute;n de datos geogr&aacute;ficos, las estructuras de datos topol&oacute;gicas y la visualizaci&oacute;n de datos espaciales.
				Me gusta el trabajo te&oacute;rico, pero distruto m&aacute;s implementar mis ideas en prototipos funcionales, y cuando son suficientemente serios, en <a href="{{ site.baseurl }}/{{ page.lang }}/code/">software libre</a>.
			</p>
			<p>
				Adem&aacute;s de mi trabajo, me apasiona viajar y conocer el mundo, as&iacute; como aprender sobre las artes, la ciencia y la tecnolog&iacute;a.
				Creo fielmente en las sociedades libres, tolerantes y diversas, y apoyo todo tipo de pol&iacute;ticas progresistas, especialmente cuando &eacute;stas se relacionan a los derechos humanos y la privacidad, la ciencia y la tecnolog&iacute;a, y el internet.
				Me gustan las cosas sencillas hechas bien, as&iacute; como la fotograf&iacute;a, los idiomas, los trenes y el transporte p&uacute;blico, la tipograf&iacute;a, el rock progresivo, el jazz y la m&uacute;sica cl&aacute;sica.
				Me desagrada el comercialismo, el nacionalismo, la mayor&iacute;a de la propiedad intelectual y todos los deportes.
			</p>
		</div>
	</div>
</div>