---
layout: default
title: Acerca de
file: index.html
lang: es
---

<div class="container">
	<div class="row">
		<div class="col col-12 col-md-6">
			<p></p>
			<img src="{{ site.baseurl }}/img/me/42.jpg" class="img-fluid" alt="Ken Arroyo Ohori" />
			<p></p>
		</div>
		<div class="col col-12 col-md-6">
			<h1>Acerca de</h1>
			<p>
				Soy un investigador postdoctoral en el grupo de <a href="https://3d.bk.tudelft.nl/">Geoinformaci&oacute;n 3D</a> de la <a href="http://www.tudelft.nl/en/">Universidad de Tecnolog&iacute;a de Delft</a>, en Holanda.
				Tambi&eacute;n soy el secretario del <a href="http://www2.isprs.org/commissions/comm4/wg1.html">grupo de trabajo IV/1</a> en modelaci&oacute;n multi-dimensional dentro de ISPRS.
			</p>
			<p>
				Mi investigaci&oacute;n cubre diversos aspectos sobre la informaci&oacute;n geogr&aacute;fica, con un enfoque en el procesamiento geom&eacute;trico y topol&oacute;gico de los datos.
				Estos incluyen: las estructuras de datos y algoritmos con objetos en altas dimensiones (4D o m&aacute;s), la integraci&oacute;n de datos GIS y BIM, la validaci&oacute;n y reparaci&oacute;n de datos geogr&aacute;ficos, y la visualizaci&oacute;n de datos espaciales.
				Me gusta el trabajo te&oacute;rico, pero distruto m&aacute;s implementar mis ideas en prototipos funcionales, y cuando son suficientemente serios, en <a href="{{ site.baseurl }}/{{ page.lang }}/code/">software libre</a>.
			</p>
			<p>
				Adem&aacute;s de mi trabajo, me apasiona viajar y conocer el mundo, as&iacute; como aprender sobre las artes, la ciencia y la tecnolog&iacute;a.
				Creo fielmente en las sociedades libres, tolerantes y diversas, y apoyo todo tipo de pol&iacute;ticas progresistas, especialmente cuando &eacute;stas se relacionan a los derechos humanos y la privacidad, la ciencia y la tecnolog&iacute;a, y el internet.
				Me gustan las cosas sencillas hechas bien, as&iacute; como la fotograf&iacute;a, los idiomas, los trenes y el transporte p&uacute;blico, la tipograf&iacute;a, el rock progresivo, el jazz y la m&uacute;sica cl&aacute;sica.
			</p>
		</div>
	</div>
</div>